Repository: rinrinne/IDEA_resources_jp
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: "{0}" is not a directory.
ja: "{0}" はディレクトリではありません。

source: "{0}" not found
ja: "{0}" は見つかりません

source: &Add
ja: 追加(&A)

source: &Add...
ja: 追加(&A)...

source: &Alias:
ja: エイリアス(&A) :

source: &All files in directory {0}
ja: ディレクトリ {0} のすべてのファイル(&A)

source: &Applet class
ja: アプレット クラス(&A)

source: &Apply
ja: 適用(&A)

source: &Background
ja: バックグラウンド(&B)

source: &Backward
ja: 前へ(&B)

source: &Cancel
ja: キャンセル(&C)

source: &Case sensitive
ja: 大文字/小文字を区別する(&C)

source: &Class:
ja: クラス(&C):

source: &Classpath:
ja: クラスパス(&C):

source: &Close
ja: 閉じる(&C)

source: &Close message view if no error occurred
ja: エラーがない場合はメッセージ ビューを閉じる(&C)

source: &Command line arguments for running remote JVM
ja: 次のコマンド ライン引数を使用してリモート JVM を実行します(&C)

source: &Copy
ja: コピー(&C)

source: &Copy text to clipboard
ja: テキストをクリップボードにコピー(&C)

source: &Create new module
ja: 新規モジュールを作成する(&C)

source: &Create source directory
ja: ソース ディレクトリを作成する(&C)

source: &Debug
ja: デバッグ(&D)

source: &Derived classes
ja: 派生クラス(&D)

source: &Derived interfaces
ja: 派生インターフェイス(&D)

source: &Do not create source directory
ja: ソース ディレクトリを作成しない(&D)

source: &Duplicate Block
ja: 重複ブロック(&D)

source: &Duplicate Line
ja: 重複行(&D)

source: &Duplicate keys with different values
ja: 異なる値で重複するキー(&D)

source: &Edit
ja: 編集(&E)

source: &Edit Configurations
ja: 設定の編集(&E)

source: &Edit...
ja: 編集(&E)...

source: &Expression:
ja: 式(&E):

source: &File scope
ja: ファイル スコープ(&F)

source: &File {0}
ja: ファイル(&F) {0}

source: &Finish
ja: 終了(&F)

source: &Flatten packages
ja: パッケージをフラット表示する(&F)

source: &Global
ja: グローバル(&G)

source: &Go to
ja: 移動(&G)

source: &HTTP Proxy Settings...
ja: HTTP プロキシ設定(&H)...

source: &Height:
ja: 高さ(&H):

source: &Home:
ja: ホーム(&H):

source: &Host name:
ja: ホスト名(&H):

source: &Icon Path:
ja: アイコンのパス:

source: &Ignore case
ja: 大文字/小文字を区別しない(&I)

source: &Implementing classes
ja: クラスの実装(&I)

source: &Import existing module
ja: 既存のモジュールをインポートする(&I)

source: &Include subdirectories
ja: サブディレクトリを含む(&I)

source: &Insert imports on paste:
ja: インポートの挿入(&I) :

source: &Instance filters:
ja: インスタンス フィルタ(&I):

source: &Locale:
ja: ロケール(&L):

source: &Log File Location:
ja: ログ ファイルの場所(&L):

source: &Log file:
ja: ログ ファイル(&L):

source: &Login:
ja: ログイン(&L):

source: &Mark All
ja: すべてマーク(&M)

source: &Maximum heap size (Mb):
ja: 最大ヒープ サイズ (MB):

source: &Module Scope
ja: モジュール スコープ(&F)

source: &Module name:
ja: モジュール名(&M):

source: &Module:
ja: モジュール(&M):

source: &Name:
ja: 名前(&N):

source: &Narrow &&down on typing
ja: 入力時に絞り込む(&N)

source: &Narrow &&down the list on typing
ja: 入力時にリストを絞り込む(&N)

source: &Narrow down the list on typing
ja: 入力時にリストを絞り込む(&N)

source: &Next
ja: 次へ(&N)

source: &Next Tip
ja: 次のヒント(&N)

source: &No
ja: いいえ(&N)

source: &OK
ja: OK(&O)

source: &Optimize imports
ja: インポートの最適化(&O)

source: &Other command line arguments:
ja: その他のコマンド ライン引数 (&O):

source: &Output directory:
ja: 出力ディレクトリ(&O):

source: &Package{0}
ja: パッケージ {0} (&P)

source: &Pass count:
ja: パス カウント(&P):

source: &Password:
ja: パスワード (&P):

source: &Pattern:
ja: パターン(&P):

source: &Policy file:
ja: ポリシー ファイル(&P):

source: &Preserve case
ja: 大文字/小文字を保持する(&P)

source: &Previous
ja: 戻る(&P)

source: &Previous Tip
ja: 前のヒント(&P)

source: &Profile:
ja: プロフィール(&P):

source: &Project Scope
ja: プロジェクト スコープ(&P)

source: &Remember password
ja: パスワードを記憶する(&R)

source: &Remove
ja: 削除(&R)

source: &Report to JetBrains
ja: JetBrains へのレポート(&R)

source: &Reset
ja: リセット(&R)

source: &Result:
ja: 結果:

source: &Save ''{0}'' Configuration
ja: {0} 設定の保存(&S)

source: &Scope
ja: スコープ(&S)

source: &Search in comments and strings
ja: コメントと文字列内を検索(&S)

source: &Selected text
ja: 選択したテキスト(&S)

source: &Send
ja: 送信(&S)

source: &Set Default...
ja: デフォルト設定(&S)...

source: &Set icon
ja: アイコンの設定(&S)

source: &Socket
ja: ソケット(&S)

source: &Start
ja: 開始(&S)

source: &Stop Searching
ja: 検索の中止(&S)

source: &Transform
ja: 変形(&T)

source: &URL
ja: URL(&U)

source: &Unmark All
ja: すべてのマークを解除(&U)

source: &Unscramble stacktrace
ja: スタックトレースを分解する(&U)

source: &Usages
ja: 使用箇所(&U)

source: &Username:
ja: ユーザ名(&U):

source: &VM options for appletviewer:
ja: アプレット ビューアの VM オプション(&V):

source: &View Source
ja: ソースの表示(&V)

source: &Whole project
ja: プロジェクト全体(&W)

source: &Width:
ja: 幅(&W):

source: &Working directory:
ja: 作業ディレクトリ(&W):

source: &Yes
ja: はい(&Y)

source: ''boolean'' value expected in condition
ja: ''boolean'' 値が条件内に必要です

source: ''{0}'' doesn''t appear to be a valid {1} installation home.
ja: ''{0}'' は有効な {1} インストール ホームではありません。

source: ''{0}'' is bad configured
ja: "{0}" の設定が不正です

source: ''{0}'' is not a valid JRE home
ja: ''{0}'' は有効な JRE ホームではありません

source: ''{0}'' is not valid JRE home
ja: ''{0}'' は有効な JRE ホームではありません

source: ''{0}'' may not contain objects of type ''{1}''
ja: ''{0}'' は、タイプ ''{1}'' のオブジェクトを含んでいない可能性があります

source: ''{0}'' with errors
ja: ''{0}'' にはエラーがあります

source: ''{0}'' with no errors
ja: ''{0}'' にはエラーがありません

source: 'Next Error' action goes to high priority problems only
ja: '次のエラー' 選択時はエラー箇所にのみ移動する

source: 'Node &has descendands' expression (optional):
ja: 'ノードは子孫を持つ' の式 (オプション) (&H):

source: 'boolean' value expected in condition
ja: 'boolean' 値が条件内に必要です

source: 'catch' left brace
ja: "catch" の左中括弧

source: 'catch' parentheses
ja: "catch" の小括弧

source: 'do' left brace
ja: "do" の左中括弧

source: 'else' left brace
ja: "else" の左中括弧

source: 'finally' left brace
ja: "finally" の左中括弧

source: 'for' left brace
ja: "for" の左中括弧

source: 'for' parentheses
ja: "for" の小括弧

source: 'if' left brace
ja: "if" の左中括弧

source: 'if' parentheses
ja: "if" の小括弧

source: 'switch' left brace
ja: "switch" の左中括弧

source: 'switch' parentheses
ja: "switch" の小括弧

source: 'synchronized' left brace
ja: "synchronized" の左中括弧

source: 'synchronized' parentheses
ja: "synchronized" の小括弧

source: 'this' is not available
ja: 'this' は利用できません

source: 'try' left brace
ja: "try" の左中括弧

source: 'while' left brace
ja: "while" の左中括弧

source: 'while' parentheses
ja: "while" の小括弧

source: '{'{0}@{5}'}'.{1} will be accessed at {2}({3}:{4,number,#})
ja: '{'{0}@{5}'}'.{1} に{2}({3}:{4,number#})でアクセスします

source: (INVALID)
ja: (不正)

source: (Read-only)
ja: (読み取り専用)

source: (actual attribute value''{0}'')
ja: (実際の属性値 ''{0}'')

source: (not specified)
ja: (指定なし)

source: ({0} usages)
ja: ({0} 使用箇所)

source: - negate the pattern (allowed only at the start of a pattern) Use ; (semicolon) to separate resource patterns; Escape the "!" character with a backslash ("\").
ja: - パターンの否定 (パターンの最初でのみ可) セミコロン (";") を使用してリソース パターンを分割。 バックスラッシュ ("\") で "!" 文字をエスケープ。

source: - one character * - zero or more characters !
ja: - 1 文字 * - ゼロまたはそれ以上の文字 !

source: - the call to remove() will be highlighted.
ja: - remove()への呼び出しが強調表示されます。

source: - the usage of <String> will be highlighted.
ja: -<String>の使用法が強調表示されます。

source: 1 day
ja: 1 日

source: 1-Year Educational License.
ja: 1 年間の学校教育向けライセンス。

source: <% page content %>
ja: <% ページ内容 %>

source: <Default Package>
ja: <デフォルト パッケージ>

source: <Default>
ja: <既定>

source: <Do not unscramble>
ja: <分解しない>

source: <No name>
ja: <名前なし>

source: <None>
ja: <なし>

source: <The list of build files is empty>
ja: <ビルド ファイルのリストはありません>

source: <all other imports>
ja: <その他すべてのインポート>

source: <blank line>
ja: <空白行>

source: <default target>
ja: <デフォルト ターゲット>

source: <default>
ja: <デフォルト>

source: This is a built-in template used for replacing a string concatenation (e.g. String s = "Hello " + name;) with an internationalized Java code expression (e.g. String s = MessageFormat.format(​myResourceBundle.getString(​"hello.0"), name);).
ja: これは、国際化された Java コード式 (例えば、String s = MessageFormat.format(myResourceBundle.getString("hello {0}"), name);) で 置換文字列結合 (例えば、String s = "Hello " + name;) に使用されるビルトイン テンプレートです。

source: <html><a href="#">Set up HTTP proxy settings</a></html>
ja: <html><a href="#">HTTP プロキシ設定</a></html>

source: <html><body>Check option above on for per-project code style configuration<br>or use global code style.
ja: <html><body>上記のオプションにより、プロジェクト単位のコード スタイル設定<br>または、グローバル コード スタイルを使用するか指定してください。

source: <html><body>IDE internal error occurred.<br>Click to see details and submit a bug report.</body></html>
ja: <html><body>IDE 内部エラーが発生しました。<br>クリックして詳細を確認し、 JetBrains へバグ レポートを提出してください</body></html>

source: <html><body>Please read the following license agreement carefully.<br>To proceed you must agree to all terms of this license by selecting the checkbox.</html></body>
ja: <html>以下の使用許諾契約書を注意深くお読みください。 この製品を使用するには、使用許諾契約に同意する必要があります。</html>

source: <html><body>Suggest @Nullable annotation for methods that may possibly return null and <br>report nullable values passed to non-annotated parameters</body></html>
ja: <html><body>null を返す可能性のあるメソッドに @Nullable 注釈を付けることを推奨します。<br> そして、注釈のないパラメータへnullとなり得る変数が渡されることを報告すべきです。</body></html>

source: <html><body>The current project is configured to use its own code style.<br>Changes made to global code style settings will not affect formatting in the current project.<br>See Project Settings | Code Style.<br>Press \&quot;Edit Global Settings\&quot; button below if you still want to edit global settings.</body></html>
ja: <html><body>現在のプロジェクトは、独自のコード スタイルを使用するように設定されています。<br>グローバル コード スタイル設定への変更は、現在のプロジェクトに反映しません。<br>[プロジェクト設定] - [コード スタイル] を参照してください。<br>グローバル設定を編集するには、以下の \\&quot;Edit Global Settings&quot; ボタンを押してください。</body></html>

source: <html><body>There are possible side effects found in expressions assigned to the variable ''{0}''<br>You can:<ul><li><b>Remove</b> variable usages along with all expressions involved</li></body></html>
ja: <html><body> 変数 ''{0}'' に代入された式で可能性のある副作用が見つかりました。<br> 次のことができます :<ul><li>含まれているすべての式と共に変数の使用箇所を<b>削除</b>する。</li> </body></html>

source: <html><body>Unable to read Tip Of The Day ({0}).
ja: <html><body>ヒント{0}が表示できません。

source: <html>Activate left neighbouring tab</html>
ja: <html>左に隣接したタブをアクティブにする</html>

source: <html>Activate most recently opened tab</html>
ja: <html>最後に開いたタブをアクティブにする</html>

source: <html>Anonymous classes</html>
ja: <html>匿名クラス</html>

source: <html>Automatically position mouse cursor on default button</html>
ja: <html>自動的にマウス カーソルをデフォルト ボタンに移動する</html>

source: <html>Change font size (Zoom) with Ctrl+Mouse Wheel</html>
ja: <html>Ctrl+マウスホイールでフォントのサイズ変更を可能にする</html>

source: <html>Enable Drag'n'Drop functionality in editor</html>
ja: <html>エディタ内でのドラッグ＆ドロップを可能にする</html>

source: <html>Honor "CamelHumps" words settings when selecting on<br/>double click</html>
ja: <html><body>ダブルクリックで選択したときに<br>"キャメル ケース"を有効にする</body></html>

source: <html>If you would like to get notified when the exceptions you submit are fixed,<br>please fill in your JetBrains Account login and password.</html>
ja: <html>エラーの詳細に再現方法を入力してください。<br>エラーが修復されたときに報告を受ける場合は、<br>JetBrainsログイン/パスワードを入力してください。</html>

source: <html>Maximum number of contents to keep in clipboard:</html>
ja: <html>クリップボードに保持するコンテンツの最大数 :</html>

source: <html>Report @NotNull &parameters overriding @Nullable and <br>@Nullable methods overriding @NotNull</html>
ja: <html>@Nullable メソッドによる @NotNull のオーバーライドや、@NotNullによる@Nullableのオーバーライドをレポート</html>

source: <html>Simple property accessors<html>
ja: <html>単一プロパティ アクセッサ<html>

source: <html>Suggest private for inner class members when referenced from outer class only</html>
ja: <html>外部クラスからのみ参照される内部クラス メンバをプライベートに示す</html>

source: <html>The code fragment which you have pasted uses classes that are not accessible by imports in the new context.<br/>Select classes that you want to import to the new file.</html>
ja: <html>貼り付けたコード フラグメントは、新しいコンテキストのインポートでアクセスできないクラスを使用しています。<br/>新規ファイルにインポートするクラスを選択してください。</html>

source: <html>The code fragment which you have pasted uses elements that are not accessible by imports in the new context.<br/>Select elements that you want to import to the new file.</html>
ja: <html>貼り付けたコード フラグメントは、新しいコンテキストのインポートでアクセスできない要素を使用しています。<br/>新規ファイルにインポートする要素を選択してください。</html>

source: <html>There is not enough memory to perform the requested operation.<br>Please increase ''{0}'' setting and restart the IDE for change to take effect.</html>
ja: <html>要求した処理を実行するための十分なメモリがありません。<br>"{0}" の 設定を増やしたのち、IDEを再スタートして設定を有効にしてください。</html>

source: <html>When number of opened editors exceeds tab limit:</html>
ja: <html>開いたエディタ数が表示タブ数の制限を超えたとき :</html>

source: <invalid>
ja: <無効>

source: <no-name>
ja: <名前未設定>

source: <noname>
ja: <名前なし>

source: <unknown>
ja: <不明>

source: <unnamed>
ja: <名前未設定>

source: @NotNull/@Nullable problems
ja: @NotNull/@Nullable 問題

source: @throws or @exception
ja: @throws または @exception

source: A module content root is a directory where the files that belong to the module are stored.
ja: モジュール コンテント ルートは格納するモジュールが属するディレクトリです。

source: A name should be specified
ja: 名前を指定してください

source: A scheme with this name already exists or was deleted without applying the changes
ja: この名前のスキームは、既に存在するか変更を適用せずに削除されています。

source: A&dd
ja: 追加(&D)

source: A&dd...
ja: 追加(&D)...

source: A&pply
ja: 適用(&P)

source: ANT ''{0}'' is not configured
ja: ANT ''{0}'' は未設定です

source: ANT buildfiles
ja: ANTビルドファイル

source: Abbreviate Qualified Package Names
ja: パッケージ名の略称

source: Absolute label indent
ja: 絶対ラベル インデント

source: Abstract\&nbsp;class
ja: Abstract\&nbsp;クラス

source: Abstraction issues
ja: 抽象化問題

source: Accept Resolution
ja: 解決策の適用

source: Accept all terms of the license
ja: 使用許諾契約に同意する

source: Accept suggested access level
ja: 推奨するアクセス レベルを適用する

source: Access is denied.
ja: アクセスは拒否されました。

source: Access static ''{1}.{0}'' via class ''{2}'' reference
ja: クラス ''{2}'' 参照により静的 ''{1}.{0}' にアクセスする

source: Access static member via instance reference
ja: インスタンス参照を通した静的メンバへのアクセス

source: Access static via class reference
ja: クラス参照により静的にアクセスする

source: Across modu&le dependencies
ja: モジュール依存の全域(&L)

source: Action
ja: アクション

source: Action Description
ja: アクションの説明

source: Action: {0}
ja: アクション: {0}

source: Activate {0} window
ja: {0} ウィンドウのアクティベート

source: Actual
ja: 実際

source: Actual :
ja: 実際:

source: Actual method parameter is the same constant
ja: 実際のメソッド パラメータは同じ定数です

source: Actual value of parameter ''{0}'' is always ''{1}''
ja: 実際のパラメータ ''{0}'' の値は常に ''{1}'' です。

source: Add
ja: 追加

source: Add &Keyboard Shortcut...
ja: キーボード ショートカットの追加(&K)...

source: Add &Mouse Shortcut...
ja: マウス ショートカットの追加(&M)...

source: Add &Package
ja: パッケージの追加(&P)

source: Add &Separator
ja: セパレータの追加(&S)

source: Add ''new {0}[]''
ja: ''new {0}[]'' を追加する

source: Add ''{0}'' to ''{1}'' throws list
ja: ''{1}'' throwsリストに ''{0}'' を追加する

source: Add 'catch' clause(s)
ja: キャッチ句の追加

source: Add 'return' statement
ja: return 文の追加

source: Add A&fter...
ja: 後ろに追加(&F)

source: Add A&ll in Directory
ja: ディレクトリにすべて追加(&L)

source: Add All Open Tabs To New Favorites List
ja: 開いているすべてのタブを新規お気に入りリストに追加

source: Add Blank
ja: 空白の追加

source: Add Default Constructor
ja: デフォルト コンストラクタの追加

source: Add Field Watchpoint
ja: フィールドのウォッチポイントを追加

source: Add Filter
ja: フィルタの追加

source: Add Import
ja: インポートの追加

source: Add Instance Filter
ja: インスタンス フィルタの追加

source: Add Method
ja: メソッドを追加

source: Add Method ''{0}'' to Class ''{1}''
ja: クラス ''{1}'' へのメソッド ''{0}'' の追加

source: Add New Configuration
ja: 新規設定の追加

source: Add New Favorites List
ja: 新規お気に入りリストへの追加

source: Add New Keyword
ja: 新規キーワードの追加

source: Add Package
ja: パッケージの追加

source: Add Pattern
ja: パターンの追加

source: Add Runtime Exception to Method Signature
ja: メソッド シグネチャにランタイム例外を追加

source: Add Separator
ja: セパレータの追加

source: Add To _New Favorites List
ja: 新規お気に入りリストに追加(_N)

source: Add TypeCast
ja: 型キャスト の追加

source: Add Variable
ja: 変数の追加

source: Add Wildcard
ja: ワイルドカードの追加

source: Add an existing Ant build file to the list
ja: リストに既存の Ant ビルド ファイルを追加します

source: Add exception to catch clause
ja: キャッチ句への例外の追加

source: Add exception to method signature
ja: メソッド シグネチャに例外を追加

source: Add method body
ja: メソッド本体を追加

source: Add missing new expression
ja: 見つからない新規の式を追加する

source: Add new renderer
ja: 新規レンダラの追加

source: Add property definition ''{0}''
ja: プロパティ定義 ''{0}'' の追加

source: Add runtime exception(s) to method signature
ja: メソッド シグネチャにランタイム例外を追加

source: Add unambiguous imports on the fly
ja: 明確なインポートの場合はオンザフライで追加する

source: Add {0} no-args constructor to {1}
ja: {0} へのパブリックな引数がないコンストラクタの追加

source: Add {0} to custom tags
ja: カスタム タグに {0} を追加する

source: Additional Classpath
ja: 追加の クラスパス

source: Additive operators (+, -)
ja: 加法演算子 (+、-)

source: Adjust Package Name
ja: パッケージ名の調整

source: After ':'
ja: ':' の後

source: After ':' in label declaration
ja: ラベル宣言の ':' の後

source: After '?'
ja: '?' の後

source: After Compilation
ja: コンパイル後

source: After class header:
ja: クラスヘッダの後:

source: After comma
ja: カンマの後

source: After description
ja: 説明の後

source: After imports:
ja: import の後:

source: After package statement:
ja: package 文の後:

source: After parameter descriptions
ja: パラメータ説明の後

source: After return tag
ja: return タグの後

source: After semicolon
ja: セミコロンの後

source: After tag name
ja: タグ名の周囲

source: After type cast
ja: 型キャストの後

source: Align attributes
ja: 属性の位置合わせをする

source: Align parameter descriptions
ja: パラメータ説明の位置を合わせる

source: Align text
ja: テキストの位置合わせをする

source: Align thrown exception descriptions
ja: スローされた例外の説明の位置を合わせる

source: Alignment
ja: 位置合わせ

source: All
ja: すべて

source: All Actions
ja: すべてのアクション

source: All Tests
ja: すべてのテスト

source: All Tests Passed
ja: すべてのテストに合格

source: All Tests in Package
ja: パッケージ内のすべてのテスト

source: All classes
ja: すべてのクラス

source: All classes are derived from java.lang.Object
ja: すべてのクラスは java.lang.Object から派生します

source: All elements are null
ja: すべての要素は NULL です

source: All file types
ja: すべてのファイル

source: All files and subdirectories in "{0}" will be deleted.
ja: "{0}" のすべてのファイルとサブディレクトリを削除します。

source: All files and subdirectories in the selected directory(s) will be deleted.
ja: 選択したディレクトリのすべてのファイルとサブディレクトリを削除します。

source: All files in &directory {0}
ja: ディレクトリ {0} のすべてのファイル(&D)

source: All files in directory {0}
ja: ディレクトリ {0} のすべてのファイル

source: All implementations of this method always return {0}
ja: このメソッドのすべての実装は常に {0} を返します

source: All implementations of this method are empty
ja: このメソッドのすべての実装は空です。

source: All in &Package
ja: パッケージ内のすべて(&P)

source: All keymaps should have non empty names
ja: すべてのキーマップには、名前を付与する必要があります

source: All keymaps should have unique names
ja: すべてのキーマップは一意の名前にする必要があります

source: All the predefined variables from the File Header template (Includes tab) are also available (e.g. ${USER}, ${DATE}, etc.)
ja: ファイルヘッダー テンプレートからの事前定義された変数全て (tabを含め ) は (例えば ${USER}, ${DATE}など)としても有効です。

source: Allow placement of caret after end of line
ja: 行末以降へのキャレット移動を許可する

source: Allow placement of caret inside tabs
ja: タブ文字内へのキャレット移動を許可する

source: Along with Java expressions and comments, you can also use predefined variables (listed below) that will then be expanded like macros into the corresponding values.
ja: Java 式とコメント以外に、マクロのように対応する値に展開されるあらかじめ定義されている変数 (下記を参照) を使用することもできます。

source: Along with Java expressions and comments, you can also use predefined variables that will be then expanded into the corresponding values.
ja: Java 式とコメント以外に、対応する値に展開されるあらかじめ定義されている変数を使用することもできます。

source: Along with static text, code and comments, you can also use predefined variables (listed below) that will then be expanded like macros into the corresponding values.
ja: 静的テキスト (コードとコメント) 以外に、マクロのように対応する値に展開されるあらかじめ定義されている変数(以下のリスト参照）を使用することもできます。

source: Along with static text, code and comments, you can also use predefined variables that will then be expanded like macros into the corresponding values.
ja: 静的テキスト (コードとコメント) 以外に、マクロのように対応する値に展開されるあらかじめ定義されている変数を使用することもできます。

source: Always
ja: 常に

source: An attempt was made to load a program with an incorrect format.
ja: 不正なフォーマットのプログラムを読み込もうとしました。

source: Analysing font: {0}
ja: フォントを分析しています : {0}

source: Analysis completed
ja: 解析が終了しました。

source: Analyze Stacktrace
ja: スタックトレースの分析

source: Animate windows
ja: ウィンドウをアニメーション表示する

source: Annotation parameters
ja: 注釈パラメータ

source: Annotation parentheses
ja: 注釈の小括弧

source: Annotations
ja: 注釈

source: Anonymize &Fields
ja: フィールドの分析(&F)

source: Anonymize &Literals
ja: 表現の分析(&L)

source: Anonymize &Methods
ja: メソッドの分析(&M)

source: Anonymize &Types
ja: タイプの分析(&T)

source: Anonymize Local &Variables
ja: ローカル変数の匿名化(&V)

source: Anonymize uncommon subexpressions simpler than
ja: 次よりも単純な共通部分式を匿名化する

source: Anonymous class
ja: 匿名クラス

source: Anonymous class derived from {0}
ja: {0} から派生した匿名クラス

source: Anonymous class evaluation is not supported
ja: 匿名クラスの評価はサポートされていません

source: Ant Build
ja: Ant ビルド

source: Ant Build Input
ja: Ant ビルド入力

source: Ant Build Progress
ja: Ant ビルドの進捗

source: Ant Process is active.
ja: Ant プロセスはアクティブです。

source: Ant Setup
ja: Ant セットアップ

source: Ant Targets
ja: Ant ターゲット

source: Ant build aborted in {0} at {1}
ja: Ant ビルドは {0} の {1} で中断しました

source: Ant build completed successfully in {0} at {1}
ja: Antビルドは {0} の {1} で正常終了しました

source: Ant build files successfully generated: {0}
ja: Ant ビルド ファイルを正常に生成しました: {0}

source: Ant build started
ja: Ant ビルドを開始しました

source: Ant command &line:
ja: Ant コマンド ライン(&L):

source: Ant process from the same build file is active.
ja: 同じビルド ファイルからの Ant プロセスはアクティブです。

source: Ant project name
ja: Ant プロジェクト名

source: Ant properties declaration
ja: Ant プロパティ宣言

source: Ant property
ja: Ant プロパティ

source: Ant support features
ja: Ant サポート機能

source: Ant target
ja: Ant ターゲット

source: Ant task
ja: Ant タスク

source: Any exception
ja: 任意の例外

source: Apache Ant version {0}
ja: Apache Ant バージョン {0}

source: Appearance
ja: 外観

source: Append
ja: 追加

source: Applet
ja: アプレット

source: Applet &class:
ja: アプレット クラス(&C):

source: Applet Class
ja: アプレット クラス

source: Applet Parameters
ja: アプレット パラメータ

source: Applet configuration
ja: アプレット設定

source: Application
ja: アプリケーション

source: Apply a quickfix
ja: クイックフィックスの適用

source: Apply an inspection quickfix
ja: 検査クイックフィックスの適用

source: Apply editor font settings
ja: 等幅フォントのみ表示する

source: Apply renderer to objects of type (fully-qualified name):
ja: レンダラをタイプのオブジェクトに適用する(完全修飾名):

source: Archive files
ja: アーカイブ ファイル

source: Are you sure you want to continue?
ja: 続行してよろしいですか ?

source: Are you sure you want to exit {0}?
ja: {0} を終了します。よろしいですか ?

source: Around "=" in attribute
ja: 属性の "=" の周囲

source: Around Operators
ja: 演算子の周囲

source: Around class:
ja: class の周囲:

source: Around field:
ja: フィールドの周囲 :

source: Around method:
ja: メソッドの周囲:

source: Array has been collected
ja: 配列が収集されました

source: Array initializer
ja: 配列初期化子

source: Array initializer braces
ja: 配列初期化子の中括弧内

source: Array initializer left brace
ja: 配列初期化子の左中括弧

source: Array reference expected
ja: 配列参照が必要

source: Array sta&rt index:
ja: 配列開始インデックス(&R):

source: Array type expected
ja: 配列タイプが必要です

source: Ask
ja: 確認する

source: Aspects
ja: アスペクト

source: Assign Shortcut...
ja: ショートカットの割り当て...

source: Assigned to {0}
ja: {0} に割り当て

source: Assignment issues
ja: 代入問題

source: Assignment operators (=, +=, ...)
ja: 代入演算子 (=、+=、...)

source: Assignments
ja: 代入

source: Attach
ja: アタッチ

source: Attempt to modify read-only document
ja: 読み取り専用ファイルは変更できません

source: Attribute name
ja: 属性名

source: Attribute value
ja: 属性値

source: Auto Scroll to Source
ja: ソースに自動スクロール

source: Auto-detect proxy settings
ja: プロキシ設定の自動検出

source: Auto-insert when only one choice on:
ja: 選択が 1 つのときのオートコンプリート:

source: Autocomplete common prefix
ja: 共通の接頭辞をオートコンプリートする

source: Automatically insert closing tag
ja: 自動的に閉じるタグを挿入する

source: Autopopup documentation in (ms):
ja: JavaDoc の自動ポップアップ間隔 (ミリ秒):

source: Autopopup in (ms):
ja: 自動ポップアップ間隔 (ミリ秒):

source: Autopopup:
ja: 自動ポップアップ:

source: Autoreparse delay (ms):
ja: 自動解析までの間隔 (ミリ秒):

source: Autoscroll to new &local variables
ja: 新規ローカル変数に自動スクロールする(&L)

source: Average usage frequency
ja: 平均使用頻度

source: Back
ja: 戻る

source: Background
ja: 背景
